<a href="https://colab.research.google.com/github/dilrubashowkat/MLearn/blob/master/Untitled3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!kaggle datasets download -d spscientist/students-performance-in-exams

Downloading students-performance-in-exams.zip to /content
  0% 0.00/7.95k [00:00<?, ?B/s]
100% 7.95k/7.95k [00:00<00:00, 3.05MB/s]

In [2]:
!unzip students-performance-in-exams.zip

Archive:  students-performance-in-exams.zip
  inflating: StudentsPerformance.csv

In [4]:
# Importing modules
from matplotlib import pyplot as plt
import numpy as np
import pandas as pd
import os, random, cv2
#matplotlib inline
# Let's check the labels
bf= pd.read_csv("StudentsPerformance.csv")
bf.head()
#bf.describe()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [0]:
#https://medium.com/@chaimgluck1/working-with-pandas-fixing-messy-column-names-42a54a6659cd
bf.columns = bf.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('(', '').str.replace(')', '').str.replace('/', '_')

In [18]:
#bf.describe()
bf.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [23]:
from sklearn.metrics import matthews_corrcoef
gen=bf["gender"].sample(20)
#rac = bf["race"]
math = bf["math_score"].sample(20)
print(gen)
#print(matthews_corrcoef(gen, math))

655    female
793      male
551      male
672    female
63     female
367      male
896      male
302    female
907    female
39       male
545      male
538      male
671      male
382      male
179    female
406      male
886    female
351      male
689      male
169    female
Name: gender, dtype: object